learning/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning Resources</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">Learning Resources</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5eff85e">1. Learning Resources</a></li>
<li><a href="#orgad42666">2. Computer Science</a>
<ul>
<li><a href="#org7c06ef0">2.1. Structure and Interpretation of Computer Programs</a></li>
</ul>
</li>
<li><a href="#org5aa0b00">3. Programming Languages</a>
<ul>
<li><a href="#orgc39d235">3.1. The C Programming Language (K&amp;R)</a></li>
</ul>
</li>
<li><a href="#org63de6ae">4. Tools &amp; Utilities</a>
<ul>
<li><a href="#org15d8dcd">4.1. GNU sed - Stream Editor</a></li>
</ul>
</li>
<li><a href="#org7812f8f">5. Related Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5eff85e" class="outline-2">
<h2 id="org5eff85e"><span class="section-number-2">1.</span> Learning Resources</h2>
<div class="outline-text-2" id="text-1">
<p>
Notes and exercises from programming books and technical documentation.
</p>
</div>
</div>

<div id="outline-container-orgad42666" class="outline-2">
<h2 id="orgad42666"><span class="section-number-2">2.</span> Computer Science</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7c06ef0" class="outline-3">
<h3 id="org7c06ef0"><span class="section-number-3">2.1.</span> <a href="sicp.html">Structure and Interpretation of Computer Programs</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
The classic computer science textbook by Abelson &amp; Sussman. Complete text in Org-mode format.
</p>

<p>
<b>Chapters</b>:
</p>
<ol class="org-ol">
<li>Building Abstractions with Procedures - Functions, recursion, higher-order procedures</li>
<li>Building Abstractions with Data - Data abstraction, hierarchical data, symbols</li>
<li>Modularity, Objects, and State - Assignment, mutable data, concurrency, streams</li>
<li>Metalinguistic Abstraction - Interpreters, lazy evaluation, logic programming</li>
<li>Computing with Register Machines - Machine simulation, compilation</li>
</ol>

<p>
<b>Language</b>: Scheme
</p>
</div>
</div>
</div>

<div id="outline-container-org5aa0b00" class="outline-2">
<h2 id="org5aa0b00"><span class="section-number-2">3.</span> Programming Languages</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc39d235" class="outline-3">
<h3 id="orgc39d235"><span class="section-number-3">3.1.</span> <a href="the-c-programming-language-2nd-ed/the-c-programming-language-2nd-ed.html">The C Programming Language (K&amp;R)</a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
Complete text of "The C Programming Language, 2nd Edition" by Brian W. Kernighan and Dennis M. Ritchie.
</p>

<p>
<b>Coverage</b>:
</p>
<ul class="org-ul">
<li>Chapter 1: A Tutorial Introduction</li>
<li>Chapter 2: Types, Operators and Expressions</li>
<li>Chapter 3: Control Flow</li>
<li>Chapter 4: Functions and Program Structure</li>
<li>Chapter 5: Pointers and Arrays</li>
<li>Chapter 6: Structures</li>
<li>Chapter 7: Input and Output</li>
<li>Chapter 8: The UNIX System Interface</li>
<li>Appendix A: Reference Manual</li>
<li>Appendix B: Standard Library</li>
<li>Appendix C: Summary of Changes</li>
</ul>

<p>
<b>Format</b>: Full text with code examples and exercises
</p>
</div>
</div>
</div>

<div id="outline-container-org63de6ae" class="outline-2">
<h2 id="org63de6ae"><span class="section-number-2">4.</span> Tools &amp; Utilities</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org15d8dcd" class="outline-3">
<h3 id="org15d8dcd"><span class="section-number-3">4.1.</span> <a href="GNU-sed.html">GNU sed - Stream Editor</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
Comprehensive guide to the GNU sed stream editor, from basics to advanced text processing.
</p>

<p>
<b>Topics</b>:
</p>
<ul class="org-ul">
<li>Stream editor fundamentals</li>
<li>Regular expressions in sed</li>
<li>Common editing operations</li>
<li>Pattern space and hold space</li>
<li>Multi-line processing</li>
<li>Practical examples and use cases</li>
</ul>

<p>
<b>Use Case</b>: Text processing, log analysis, automated editing
</p>
</div>
</div>
</div>

<div id="outline-container-org7812f8f" class="outline-2">
<h2 id="org7812f8f"><span class="section-number-2">5.</span> Related Resources</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="../emacs/emacs-lisp.html">Learning Emacs Lisp</a> - Comprehensive Elisp guide</li>
<li><a href="../emacs/emacs-build.html">Building Emacs from Source</a> - Cross-platform build guide</li>
</ul>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-12-14</p>
</footer>
</body>
</html>
